/**
	\file person.h
	\brief Заголовочный файл класса person
	\copyright USER
	\author Koltsov
	\date 09-16-2021
	\version 1.9
\par Использует классы:
	\ref person
\par Содержит класс
	\ref person
*/

/// Класс поисания персоны
/** Содержит данные персоны и методы для работы с ними
*/

class person
{
protected:
	char *_fio; ///< ФИО персоны
	int _age; ///< возраст
	char *_addr; ///<адрес в произвольном формате
public:
	/// Конструктор по умолчанию
	/** Создает персону и инициализирует ее поля
	*/
	person();

	/// Конструктор с заполнением полей класса
	/** Создает персону и инициализирует ее поля
		\param fio ФИО создаваемой персоны
		\param age возраст создаваемой персоны
		\param addr адрес создаваемой персоны
	*/
	person(char * fio, int age, char * addr);

	/// Деструктор освобождает ресурсы
~person();

/// Возвращает полную информацию о персоне
/** Если сведений нет, то возвращает сообщение об ошибке
\return строку и данными о персоне в формате (ФИО, возраст, адрес)
*/
char * getFullInfo();

/** \brief Изменяет адрес персоны

Перед изменением проверяет формат строки с адресом (код, город, улица, дом)
\param newAddr новый адрес персоны
\return успешность выполнения действия */
bool changeAddr(char *newAddr);
};
